# 文章中のヘッダーとフッターのパターン設定
from typing import List, Tuple

# PATTERNS_HEADER: List[Tuple[str, str]] = [
#         (r'https?://[a-zA-Z0-9.-]+\.(?:com|jp|net|org|co\.jp|biz|info|gov|edu|io|ai)(?:/[A-Za-z/]*)?(?=[^A-Za-z/]|$)', 'url'),  # URLを適切に切る
#         (r'[a-zA-Z0-9._%+-]+@[a-zA-Z0-9.-]+\.[a-zA-Z]{2,6}', 'email'),  # メールアドレス
#         (r'(TEL|ＴＥＬ|T E L|電話番号|電話|電 話)', 'phone_header'),  # 電話ヘッダ
#         (r'(\（?[\d０-９]{2,5}\）?[\s\-−－]?[0-9０-９]{1,4}[\s\-−－]?[0-9０-９]{1,4}[\s\-−－]?[0-9０-９]{1,4}|\bTEL\b[\s\-−－]?\(?[\d０-９]{2,5}\)?[\s\-−－]?[0-9０-９]{1,4}[\s\-−－]?[0-9０-９]{1,4}[\s\-−－]?[0-9０-９]{1,4})', 'phone_number'),  # 電話番号
#         (r'(プライム市場、福証)', '福証')  # 福証ヘッダ
#     ]

PATTERNS_HEADER: List[Tuple[str, str]] = [
        (r'(ついて)', 'title1'),  # ついて
        (r'(お知らせ)', 'title2'),  # お知らせ
        (r'(OVERVIEW)', 'title3'), # OVERVIEW
        (r'(業績サマリー Point)', 'title4'), # 業績サマリー Point
        (r'(百万円未満切捨て)', 'title5'), # 百万円未満切捨て
    ]

PATTERNS_FOTTER: List[Tuple[str, str]] = [
    (r'■本件に関するお問い合わせ先', 'fotter1'),
    (r'【本件に関する問合せ】', 'fotter2'),
    (r'本件に関するお問合せ', 'fotter3'),
    (r'お問い合わせ', 'fotter4'),
    (r'本資料に関するお問合せ先', 'fotter5')
]

PHONE_PATTERN = r'''
            (?<!\d)
            (
                0\d{1,4}
                [-ー−–（）\s]*       # ← ここに en dash 入れたよ！！
                \d{2,4}
                [-ー−–（）\s]*
                \d{3,4}
            )
            (?!\d)
        '''
        
DATE_PATTERN = r'''
    (?:
        [0-9０-９]{4}[ \u3000]?年[ \u3000]?[0-9０-９]{1,2}[ \u3000]?月[ \u3000]?[0-9０-９]{1,2}[ \u3000]?日 |  # yyyy年mm月dd日 の形式
        [0-9０-９]{4}[/-][0-9０-９]{1,2}[/-][0-9０-９]{1,2} |  # yyyy/mm/dd や yyyy-mm-dd の形式
        [0-9０-９]{1,2}[ \u3000]?月[ \u3000]?[0-9０-９]{1,2}[ \u3000]?日 |  # mm月dd日 の形式
        [0-9０-９]{4}[ \u3000]?年[ \u3000]?[0-9０-９]{1,2}[ \u3000]?月 |   # yyyy年mm月 の形式（2022年3月期のような）
        [0-9０-９]{1,2}[ \u3000]?年[ \u3000]?[0-9０-９]{1,2}[ \u3000]?月   # yy年mm月 の形式（2022年3月期のような）
    )
'''

# ハイフン・長音・水平バー系＋空白を許容して2回以上連続
HYPHEN_PATTERN = r'(?:[ \u3000]*[―ー‐－\-–—﹘=#＃◎✓〇﹣][ \u3000]*){2,}'

URL_PATTERN = r"""
    (?:
        https?:// |
        www\.
    )
    [\w\-._~:/?#\[\]@!$&'()*+,;=%]+
"""

DAY_OF_WEEK_PATTERN = r'[（(][月火水木金土日][）)]'

# 単位リスト（あとで追加し放題ｗｗｗ）
UNITS = ["百万円", "億円", "百万", "万円", "円", "人", "株", "%", "件", "社", "年", "号", "倍"]
